testdata/IN_2023_02/Roundtrip/datei/20140505_dateiname_case_sensitive_2023_02b.xml_request_2023_02b.xml

<?xml version="1.0" encoding="ISO-8859-1" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  
  <soapenv:Header>

</soapenv:Header>
  
  <soapenv:Body>
    
    <tarif:getOrder xmlns:allg="http://www.bipro.net/namespace/allgemein" xmlns:basis="http://www.bipro.net/namespace/basis" xmlns:dt="http://www.bipro.net/namespace/datentypen" xmlns:gevo="http://www.bipro.net/namespace/gevo" xmlns:nachr="http://www.bipro.net/namespace/nachrichten" xmlns:partner="http://www.bipro.net/namespace/partner" xmlns:pm="http://www.bipro.net/namespace/produktmodell" xmlns:pm-leben="http://www.bipro.net/namespace/versicherung/produktmodell/leben" xmlns:tarif="http://www.bipro.net/namespace/versicherung/tarifierung" xmlns:vbl="urn:de:vb:bipro:taa:leben:1.12" xmlns:vs-pm="http://www.bipro.net/namespace/versicherung/produktmodell" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
      
      <tarif:Request>
        
        <nachr:BiPROVersion>2.4.6.1.12</nachr:BiPROVersion>
        <nachr:ConsumerID>WS DEV TEAM</nachr:ConsumerID>
        
        <tarif:Antrag>
          
          <basis:Erweiterung xsi:type="vbl:CT_AntragErweiterung">
            
            <vbl:Datenschutzeinwilligung>Gesamteinwilligung</vbl:Datenschutzeinwilligung>
            
            <vbl:DatenschutzeinwilligungTodesfall>false</vbl:DatenschutzeinwilligungTodesfall>
            
            <vbl:PolitischExponiertePerson>false</vbl:PolitischExponiertePerson>
            
          </basis:Erweiterung>
          
          <gevo:Vermittler>
            
            <allg:PartnerID>10</allg:PartnerID>
            
            <allg:Vermittlerrolle>
              
              <allg:ArtID>01</allg:ArtID>
              
              <allg:Vermittlertyp>01</allg:Vermittlertyp>
              
            </allg:Vermittlerrolle>
            
          </gevo:Vermittler>
          
          <gevo:Dokumentanforderung>
            
            <gevo:ArtID>Angebot</gevo:ArtID>
            
          </gevo:Dokumentanforderung>
          
          <tarif:Partner xsi:type="partner:CT_Person">
            
            <partner:Anrede>1</partner:Anrede>
            
            <partner:Name>Takinardi</partner:Name>
            
            <partner:PartnerID>1</partner:PartnerID>
            
            <partner:Anschrift>
              
              <allg:Strasse>200 Southborough Dr.</allg:Strasse>
              
              <allg:Hausnummer>121.</allg:Hausnummer>
              
              <allg:Postleitzahl>12121</allg:Postleitzahl>
              
              <allg:Ort>Scarboro</allg:Ort>
              
              <partner:ArtID>1</partner:ArtID>
              
            </partner:Anschrift>
            
            <partner:Vorname>Allesio</partner:Vorname>
            
            <partner:Geburtsdatum>1992-11-01</partner:Geburtsdatum>
            
            <partner:Geschlecht>1</partner:Geschlecht>
            
            <partner:Geburtsort>234234</partner:Geburtsort>
            
            <partner:Staatsangehoerigkeit>D</partner:Staatsangehoerigkeit>
            
            <partner:Berufstaetigkeit>
              
              <partner:Beruf>Koch</partner:Beruf>
              
            </partner:Berufstaetigkeit>
            
          </tarif:Partner>
          
          <tarif:Partner xsi:type="partner:CT_JuristischePerson">
            
            <partner:Anrede>3</partner:Anrede>
            
            <partner:Name>55555</partner:Name>
            
            <partner:PartnerID>3</partner:PartnerID>
            
            <partner:Anschrift>
              
              <allg:Strasse>-</allg:Strasse>
              
              <allg:Hausnummer>-</allg:Hausnummer>
              
              <allg:Postleitzahl>45214</allg:Postleitzahl>
              
              <allg:Ort>123456789</allg:Ort>
              
            </partner:Anschrift>
            
          </tarif:Partner>
          
          <tarif:Partner xsi:type="partner:CT_JuristischePerson">
            
            <partner:Partnernummer>E100</partner:Partnernummer>
            
            <partner:PartnerID>10</partner:PartnerID>
            
          </tarif:Partner>
          
          <tarif:Versicherungsnehmer>
            
            <partner:PartnerID>3</partner:PartnerID>
            
          </tarif:Versicherungsnehmer>
          
          <tarif:Verkaufsprodukt>
            
            <pm:Produkt xsi:type="pm-leben:CT_Produkt">
              
              <basis:Erweiterung xsi:type="vbl:CT_ProduktErweiterung">
                
                <vbl:Tarifgruppe>Normal</vbl:Tarifgruppe>
                
              </basis:Erweiterung>
              
              <pm:GewuenschteZahlungsweise>8</pm:GewuenschteZahlungsweise>
              
              <pm:Beitrag>
                
                <pm:ArtID xmlns:datentypen="http://www.bipro.net/namespace/datentypen" xsi:type="datentypen:STE_BeitragBasis">01</pm:ArtID>
                
                <pm:Betrag>
                  
                  <allg:Betrag>111.0</allg:Betrag>
                  
                  <allg:Waehrung>EUR</allg:Waehrung>
                  
                </pm:Betrag>
                
                <pm:Zahlungsweise>8</pm:Zahlungsweise>
                
              </pm:Beitrag>
              
              <pm:Versicherungsdauer>
                
                <allg:Beginn>2023-03-01T12:00</allg:Beginn>
                
              </pm:Versicherungsdauer>
              
              <pm:Kennung>FR</pm:Kennung>
              
              <pm:Elementarprodukt xsi:type="pm-leben:CT_Rente">
                
                <basis:Erweiterung xsi:type="vbl:CT_RenteErweiterung">
                  
                  <vbl:TodesfallleistungImBezug>IndividuelleGarantiezeit</vbl:TodesfallleistungImBezug>
                  
                  <vbl:FondsrenteDaten/>
                  
                </basis:Erweiterung>
                
                <pm:Versicherungsdauer>
                  
                  <allg:AnzahlJahre>40</allg:AnzahlJahre>
                  
                  <allg:AnzahlMonate>7</allg:AnzahlMonate>
                  
                </pm:Versicherungsdauer>
                
                <vs-pm:Bezugsrecht>
                  
                  <vs-pm:Leistungsfall>Todesfall</vs-pm:Leistungsfall>
                  
                  <vs-pm:IndexBerechtigter>3</vs-pm:IndexBerechtigter>
                  
                </vs-pm:Bezugsrecht>
                
                <pm-leben:IstHauptversicherung>true</pm-leben:IstHauptversicherung>
                
                <pm-leben:UeberschussverwendungVorLeistung xmlns:datentypen="http://www.bipro.net/namespace/datentypen" xsi:type="datentypen:STE_UeberschussverwendungBasis">12</pm-leben:UeberschussverwendungVorLeistung>
                
                <pm-leben:VersichertePerson>
                  
                  <partner:PartnerID>1</partner:PartnerID>
                  
                </pm-leben:VersichertePerson>
                
                <pm-leben:BeitragsRueckgewaehrBeiTod>01</pm-leben:BeitragsRueckgewaehrBeiTod>
                
                <pm-leben:Garantiezeit>
                  
                  <allg:AnzahlJahre>5</allg:AnzahlJahre>
                  
                </pm-leben:Garantiezeit>
                
              </pm:Elementarprodukt>
              
              <pm-leben:BAV>
                
                <basis:Erweiterung xsi:type="vbl:CT_BAVErweiterung">
                  
                  <vbl:Antragsdaten>
                    
                    <vbl:Gehaltsumwandlungsvereinbarung>
                      
                      <vbl:LaufendeBezuege>true</vbl:LaufendeBezuege>
                      
                    </vbl:Gehaltsumwandlungsvereinbarung>
                    
                  </vbl:Antragsdaten>
                  
                </basis:Erweiterung>
                
                <pm-leben:Durchfuehrungsweg>Direktversicherung</pm-leben:Durchfuehrungsweg>
                
                <pm-leben:Finanzierungsform>Entgeltumwandlung</pm-leben:Finanzierungsform>
                
                <pm-leben:Zusageform>02</pm-leben:Zusageform>
                
              </pm-leben:BAV>
              
              <pm-leben:VorgabeBerechnung>
                
                <pm-leben:ArtID xmlns:datentypen="http://www.bipro.net/namespace/datentypen" xsi:type="datentypen:STE_VorgabeBerechnungBasis">Bruttobeitrag</pm-leben:ArtID>
                
                <pm-leben:Kontext xmlns:datentypen="http://www.bipro.net/namespace/datentypen" xsi:type="datentypen:STE_VorgabeBerechnungKontextBasis">Produkt</pm-leben:Kontext>
                
              </pm-leben:VorgabeBerechnung>
              
            </pm:Produkt>
            
          </tarif:Verkaufsprodukt>
          
          <tarif:BesondereVereinbarungen>Keine</tarif:BesondereVereinbarungen>
          
          <tarif:Unterschriftsverfahren>03</tarif:Unterschriftsverfahren>
          
          <tarif:Antragsart>01</tarif:Antragsart>
          
          <tarif:Beitragszahler>
            
            <partner:PartnerID>3</partner:PartnerID>
            
          </tarif:Beitragszahler>
          
        </tarif:Antrag>
        
      </tarif:Request>
      
    </tarif:getOrder>
    
  </soapenv:Body>
  
</soapenv:Envelope>
